app/controllers/events_controller.rb

SELECT "issues".* FROM "issues" WHERE "issues"."number" = $1 LIMIT $2  [["number", 1], ["LIMIT", 1]]
SELECT "events".* FROM "events"
---
    def index
      if params[:issue_id]
        @events = Issue.find_by(number: params[:issue_id]).events
      else
        @events = Event.all