app/controllers/issues_controller.rb

SELECT "issues".* FROM "issues"
---
    def index
      @issues = Issue.all